[{
    "title": "Mirror mirror on the wall",
    "description": "We've recently been working with a chain of high street mirror shops that had their e-commerce site hacked. After conducting some forensic analysis we found a cryptic message they left on the system for another hacker with the site password in it. Can you figure out what it says and get the password?",
    "difficulty": "Easy"
}, {
    "title": "Inspect & prevent",
    "description": "Our agents have observed a string of attacks on websites selling cute dog products. They also discovered that for each attack the hacker leaves a comment behind that hints of their next target. Can you find the name of the next target so we can prevent any further attacks?",
    "difficulty": "Easy"
}, {
    "title": "What lies beneath",
    "description": "There are rumours that a recently published website is providing criminals with access codes to a variety of bank vaults across the city. Agents have tracked down what we believe to be the offending website but we can't seem to find anything suspicious. Help us uncover this mystery and stop any further vault break-ins!",
    "difficulty": "Easy"
}, {
    "title": "Social engineering",
    "description": "Permission has been granted to try and log into a social media account of a hacker who goes by the name of D4YDR3AM. Luckily for us, they have been rather clumsy with their personal data. We know that their favourite holiday destination is Japan and that they were born in 1995. Can you help us guess their password?",
    "difficulty": "Easy"
}, {
    "title": "Exam time!",
    "description": "To help keep your mind sharp, the agency back at base have put together a small maths test for you to solve. But remember, you're in the world of cyber security, so not all is as it seems. Can you figure out the answer?",
    "difficulty": "Medium"
}, {
    "title": "Meeting point",
    "description": "Our agents have been intercepting messages between two hackers trying to organise a face-to-face. We've identified a particular message that we think shares the location of their next meeting. The problem we have is that they have encrypted their messages using a cipher. Can you help decipher it and uncover the location?",
    "difficulty": "Medium"
}, {
    "title": "Warehouse down!",
    "description": "An online retailer selling mobile accessories have had their warehouse operations put on halt. It looks like a hacker has managed to prevent something from running that sends orders from the website to the warehouse for dispatch. Can you help get things going again?",
    "difficulty": "Medium"
}, {
    "title": "Traffic jam",
    "description": "Agents have been trying to find the URL of a forum being used by a group of hackers with an agenda to disrupt the flow of traffic in their city. The link to the forum used to be active on the homepage of the menu below but has recently been disabled. Can you figure out what the URL is?",
    "difficulty": "Medium"
}, {
    "title": "Start-up troubles",
    "description": "A successful new start-up that sells electric scooters have found out that a handful of their customers' accounts have been hacked! Having only just entered the market and keen to maintain their otherwise excellent reputation, they have hired us to run a security audit of their login system. Can you spot any security holes?",
    "difficulty": "Medium"
}, {
    "title": "Agent Picasso",
    "description": "A talented agent of ours with a side hobby of selling abstract pieces of art, has asked for help debugging an issue with a form on her website. For whatever reason the form is unable to submit the information entered. We must help our fellow agent and her ambitions of becoming the next Picasso and fix that form! Can you figure out what the issue is?",
    "difficulty": "Hard"
}, {
    "title": "Head scratcher",
    "description": "Agents have been scratching their heads for days trying to figure out which parameters to pass in order to receive output from this suspicious looking piece of javascript (also embedded on this page). Can you find out which of the outputs is the flag?",
    "difficulty": "Hard"
}, {
    "title": "Star struck",
    "description": "A fellow agent of ours who also happens to be a bit of a movie buff needs your help solving a challenge that will win them the prize of meeting a famous movie star over dinner. It's been rumoured that the numbers sitting in the corner of each ticket equate to a winning code. What do you think agent, can you solve it?",
    "difficulty": "Hard"
}, {
    "title": "Feel the thirst",
    "description": "A pipe directly below critical construction work has burst causing chaos and panic above the surface. At the city's digital command centre, staff have tried disconnecting the pipe from its main water supply but failed. It seems as if someone has hacked into the system and cut-off communication to the pipe. Agent, can you find out what the problem is and disconnect the pipe before anything more serious happens?",
    "difficulty": "Extreme"
}, {
    "title": "Off balance",
    "description": "A new start-up bank is experiencing a major issue with their hugely successful mobile banking app. Their customers are complaining that they are able to see everything but their balance. Agent, help customers retrieve their balances and stop this start-up from going down!",
    "difficulty": "Extreme"
}, {
    "title": "Remote control?",
    "description": "A supermarket chain has noticed vulnerabilities in their systems. Can you find and exploit one of them?",
    "difficulty": "Extreme" 
}]
