{
    "part1": {
        "content": "**Welcome to the Cyber Discovery Discord Server!** This is a place to discuss all things Cyber Discovery (and a few things tangentially related as well), to meet like-minded people, and to learn more about cyber security!\nAlthough this server is set up for the UK Cyber Discovery programme, we welcome participants from sister programmes such as the US Cyber FastTrack programme. While we do not have specific channels or roles set up for other programmes, feel free to use <#509080315369881600> for discussion or to ask for help at any time.\n Permanent invite link: https://discord.cyberdiscoverycommunity.uk"
    },

    "part2": {
        "content": "What follows is an explanation of some of the **roles** and their purposes on this server. If you qualify for one of these roles, please ask a member of @Root or Sudo (explained below!); for certain roles, we may ask you to DM proof for verification.",
        "embed": {

            "color": "0x009688",

            "fields": [{
                    "name": "Root",
                    "value": "Server Administrator"
                },
                {
                    "name": "Sudo",
                    "value": "Server Moderator"
                },
                {
                    "name": "Agent J",
                    "value": "[Agent J](https://twitter.com/jameslyne) himself"
                },
                {
                    "name": "Official Cyber Discovery Staff",
                    "value": "Staff from the [Cyber Discovery](https://joincyberdiscovery.com/) program"
                },
                {
                    "name": "For Your Own Protection",
                    "value": "Moderation role to hide all channels"
                },
                {
                    "name": "Community Developer",
                    "value": "Made significant contributions to the [community GitHub projects](https://github.com/CyberDiscovery)"
                },
                {
                    "name": "True 100%",
                    "value": "Completed all of CyberStart Assess, Game, and Essentials"
                },
                {
                    "name": "100 Percent",
                    "value": "Completed all of CyberStart Game"
                },
                {
                    "name": "Veteran - 2018/2019",
                    "value": "Qualified for CyberStart Elite in 2018/2019"
                },
                {
                    "name": "Forensicator",
                    "value": "Completed GCFE"
                },
                {
                    "name": "Cyberist",
                    "value": "Completed GCIH"
                },
                {
                    "name": "Elite Talent Development",
                    "value": "Participating in the Elite Talent Development Programme"
                },
                {
                    "name": "HQ",
                    "value": "Completed the headquarters base from CyberStart Game"
                },
                {
                    "name": "Moonbase",
                    "value": "Completed moon base from CyberStart Game"
                },
                {
                    "name": "Forensics",
                    "value": "Completed forensics base from CyberStart Game"
                },
                {
                    "name": "Volcano",
                    "value": "Completed volcano base from CyberStart Game"
                },
                {
                    "name": "Partner Server",
                    "value": "Staff or significant members of affiliated servers"
                },
                {
                    "name": "Quote Czar",
                    "value": "Have the ability to quote messages in <#463657120441696256>"
                },
                {
                    "name": "Level [1-75]",
                    "value": "Automatically assigned roles for [MEE6](https://mee6.xyz/) levels"
                },
                {
                    "name": "Year [9-13]",
                    "value": "Corresponding school years"
                },
                {
                    "name": "Technically Adults",
                    "value": "Those who are now older than any of the year roles"
                },
                {
                    "name": "Trusted",
                    "value": "Can use external emoji and control Rythm"
                },
                {
                    "name": "Club Leader",
                    "value": "Restricted access for [Cyber Discovery](https://joincyberdiscovery.com/) club leaders"
                },
                {
                    "name": "Muted",
                    "value": "Cannot speak in any channel"
                },
                {
                    "name": "Game Support",
                    "value": "Used for offering assistance with CyberStart Game"
                }

            ]
        }
    },


    "part3": {
        "embed": {
            "title": "**RULES**",
            "color": "0xff0000",

            "fields": [{
                    "name": "1. No discriminatory or adult content",
                    "value": "Swearing is allowed, so long as it isn’t malicious. Racism, sexism, and any other form of harassment or offensive comment is not permitted and will be met with punishment."
                },
                {
                    "name": "2. No Spam",
                    "value": "Spam clogs up the channels, and we will take action if you post a large number of messages in a short period of time or post long messages unnecessarily."
                },
                {
                    "name": "3. Keep spam or shitposting to <#489217138020712478>",
                    "value": "<#489217138020712478> is still subject to other rules - it is not a channel for NSFW content. However, spam, inappropriate discussions, and other content deemed to be unsuitable for other channels yet still maintainable on the server should be moved here. Mention spam is not acceptable."
                },
                {
                    "name": "4. No spoilers",
                    "value": "This server is for Cyber Discovery, but not for spoiling Cyber Discovery. By giving someone else answers you’re ruining the experience for everyone."
                },
                {
                    "name": "5. No harassment",
                    "value": "Be it sexual or verbal, harassment is not acceptable. This is any targeted action towards someone else with malicious intent."
                },
                {
                    "name": "6. No unauthorised invite links",
                    "value": "A list of authorised invite links can be found on [meta](https://github.com/CyberDiscovery/meta/RULES.md#authorised-invite-links)."
                },
                {
                    "name": "7. No encouragement of illegal activity",
                    "value": "This is not limited to, but includes acts which may break the Computer Misuse Act."
                },
                {
                    "name": "8. Appropriate channels should be used at all times",
                    "value": "For example, memes belong in <#411573113156009984> not <#411573884597436416>, and discussion of Cyber Discovery challenges belong in the appropriate CyberStart channels."
                }
            ]
        }
    },

    "part4": {
        "content": "Infractions are measured by severity and punished accordingly.\n\nAttempting to evade a sanction by using another account will result in that account being permanently banned. The originally punished account may also receive an increased sanction.",
        "embed": {
            "title": "**Punishments**",
            "color": "0xff7f00",

            "fields": [{
                    "name": "1. Adult Content/Doxing/Discrimination - Temporary (14 day)/Permanent ban",
                    "value": "If the content is entirely unsuitable for the server, you will be banned. Doxing someone else is entirely unacceptable as well, as detailed in the doxing rules. Discriminating someone on the basis of sex, race, etc. will also be met with a ban."
                },
                {
                    "name": "2. Harassment - Temporary (14 day)/Permanent Ban",
                    "value": "Forms of sexual and verbal harassment are entirely unacceptable. Harassing another member on the server and ruining their experience is wrong, and, after being judged on a case-by-case basis, will be punished with a temporary or permanent ban."
                },
                {
                    "name": "3. Repeated Infractions, Consistent Spam - 3 hour mute",
                    "value": "If you receive 3 such mutes, this will escalate to a temporary ban of duration 7 days. If you make another serious infraction soon after this, you will be permanently banned."
                },
                {
                    "name": "4. Spam, Reposting Deleted Content - Warning, followed by 1h mute if continued",
                    "value": "3 of these counts as one 3h mute, and further punishments will be given accordingly. The 1 hour duration can be increased to up to 3 hours depending on whether the offence has been repeated or not."
                }
            ]
        }
    },
    "part5": {
        "embed": {
            "title": "**Doxing**",
            "description": "1. Do not expose any personal information about other people without express permission. Personal information is any info pertaining to their identity, e.g. locations, names, contact details - anything that is linked to that person.\n2. Ask the person in question first. Do not do it if you’re not sure. Do not try and find information that can dox someone else either without their permission either.\n3. Releasing your own information means it can be re-quoted. If you say something on the server, unless it is removed then anyone can re-quote it. If you want something deleted, ask a moderator. Do not harass someone else based on their information.",
            "color": "0xffd500"
        }
    },
    "part6": {
        "embed": {
            "title": "**Suggesting Changes to the Community**",
            "description": "If you feel that something on the server could/should be improved, make an issue on the meta repository at https://github.com/CyberDiscovery/meta/. This is a platform for constructive discussion around the future of our community - however, this is not the place to appeal punishments or to report moderators so please see below.",
            "color": "0xFCAF8E"
        }
    },
    "part7": {
        "embed": {
            "title": "**Reporting a Moderator/Appealing Punishments**",
            "description": "If you have a serious complaint to make about a moderator, then DM an @Root in order to get this addressed. Please do not DM unless entirely required. Do not harass a moderator about decisions they make - **we reserve the right to make decisions not covered entirely by these rules if the situation requires it.**\n\nModerators are @Root and @Sudo and are here to answer any queries you may have in DMs. We can also be DMed in order to appeal punishments. Please note that we are not Cyber Discovery staff - any personal queries regarding the program should be sent to `support@joincyberdiscovery.com`, not us. If you have any enquiry to make around the above rules, or wish to discuss a punishment or deletion, we will be happy to discuss the exact reasoning in DMs. Harassing moderators is not on - we are people as well, and any sort of malicious activity towards us, will be met with appropriate punishment.",
            "color": "0xC1EAC0"
        }
    }
}
